20211215085538-vizualise_uncertainty.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 04:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Use frequencies to vizualise uncertainty</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Use frequencies to vizualise uncertainty</h1>
<p>
One intepretation of the posterior samples we get from MCMC is that they correspond to <i>a world that is consistent the data that we observe</i>. From posterior distributions we often extract summary statistics that we then convey to the public.
</p>

<p>
Let's take infering people's intentions from poll data as an example. Two quantities are usually interesting to display:
</p>
<ol class="org-ol">
<li>The posterior distribution of intention to vote for the candidates</li>
<li>The posterior distribution of the difference of voting intentions between two candidates. A natural quantity of interest is the \(P(n_i>n_j)\), i.e. the number of times candidate \(j\) is ahead of candidate \(i\) in our simulation.</li>
</ol>

<p>
People are more or less used to the concept of credible intervals so (1) is easy-ish to represent (I like forest plots with 95% CI for symmetrical distributions).To best represent (2) we need to convey what is means that "j is ahead of i in N elections out of 100".
</p>

<p>
This is a tricky one. Language matters.
</p>
<ul class="org-ul">
<li>"Simulation of the elections"</li>
<li>"Intentions compatible with the poll results"</li>
</ul>

<p>
A dynamic plot could be helpful here. Show points arrive one after the other with counters incrementing.
</p>

<div id="outline-container-org551535f" class="outline-2">
<h2 id="org551535f">Links to this note</h2>
<div class="outline-text-2" id="text-org551535f">
<ul class="org-ul">
<li><a href="./20210504130807-politics_and_statistics.html">Politics and statistics</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
